[Killed] StringLiteral
main/components/Commons/ManageCows.js:22:106
                         </Card.Text>
                     </Col>
                     <Col>
-                        <Button variant="outline-danger" onClick={()=>{onBuy(userCommons)}} data-testid={"buy-cow-button"}>Buy cow</Button>
+                        <Button variant="outline-danger" onClick={()=>{onBuy(userCommons)}} data-testid={""}>Buy cow</Button>
                         <br/>
                         <br/>
killedBy: PlayPage tests click buy button
statusReason: Error: Unable to find an element by: [data-testid="buy-cow-button"]

<body>
  <div>
    <div
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >
      <div
