[Killed] ArrowFunction
src/main/pages/PlayPage.js:88:35
     toast(`Cow sold!`);
   }
 
-  const objectToAxiosParamsSell = (newUserCommons) => ({
-    url: "/api/usercommons/sell",
-    method: "PUT",
-    data: newUserCommons,
-    params: {
-      commonsId: commonsId,
-      numCows: 1
-    }
-  });
+  const objectToAxiosParamsSell = () => undefined;
 
   const mutationsell = useBackendMutation(
killedBy: PlayPage tests click sell button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
