[Killed] ArrowFunction
src/main/pages/PlayPage.js:63:34
     toast(`Cow bought!`);
   }
 
-  const objectToAxiosParamsBuy = (newUserCommons) => ({
-    url: "/api/usercommons/buy",
-    method: "PUT",
-    data: newUserCommons,
-    params: {
-      commonsId: commonsId,
-      numCows: 1
-    }
-  });
+  const objectToAxiosParamsBuy = () => undefined;
 
   const mutationbuy = useBackendMutation(
killedBy: PlayPage tests click buy button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
src/main/pages/PlayPage.js:63:55
     toast(`Cow bought!`);
   }
 
-  const objectToAxiosParamsBuy = (newUserCommons) => ({
-    url: "/api/usercommons/buy",
-    method: "PUT",
-    data: newUserCommons,
-    params: {
-      commonsId: commonsId,
-      numCows: 1
-    }
-  });
+  const objectToAxiosParamsBuy = (newUserCommons) => ({});
 
   const mutationbuy = useBackendMutation(
killedBy: PlayPage tests click buy button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
