[Killed] BlockStatement
main/components/Commons/ManageCows.js:21:71
                         </Card.Text>
                     </Col>
                     <Col>
-                        <Button variant="outline-danger" onClick={()=>{onBuy(userCommons)}} data-testid={"buy-cow-button"}>Buy cow</Button>
+                        <Button variant="outline-danger" onClick={()=>{}} data-testid={"buy-cow-button"}>Buy cow</Button>
                         <br/>
                         <br/>
killedBy: ManageCows tests buying and selling a cow
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/components/Commons/ManageCows.js:24:110
                         <Button variant="outline-danger" onClick={()=>{onBuy(userCommons)}} data-testid={"buy-cow-button"}>Buy cow</Button>
                         <br/>
                         <br/>
-                        <Button variant="outline-danger" onClick={()=>{onSell(userCommons, 1)}} data-testid={"sell-cow-button"}>Sell cow</Button>
+                        <Button variant="outline-danger" onClick={()=>{onSell(userCommons, 1)}} data-testid={""}>Sell cow</Button>
                         <br/>
                         <br/>
killedBy: PlayPage tests click sell button
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="sell-cow-button"]

<body>
  <div>
    <div
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >
      <div
