[Killed] BlockStatement
main/components/Commons/ManageCows.js:21:71
                         </Card.Text>
                     </Col>
                     <Col>
-                        <Button variant="outline-danger" onClick={()=>{onBuy(userCommons, 1)}} data-testid={"buy-cow-button"}>Buy cow</Button>
+                        <Button variant="outline-danger" onClick={()=>{}} data-testid={"buy-cow-button"}>Buy cow</Button>
                         <br/>
                         <br/>
killedBy: PlayPage tests click buy button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/components/Commons/ManageCows.js:21:109
                         </Card.Text>
                     </Col>
                     <Col>
-                        <Button variant="outline-danger" onClick={()=>{onBuy(userCommons, 1)}} data-testid={"buy-cow-button"}>Buy cow</Button>
+                        <Button variant="outline-danger" onClick={()=>{onBuy(userCommons, 1)}} data-testid={""}>Buy cow</Button>
                         <br/>
                         <br/>
killedBy: ManageCows tests buying and selling a cow
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="buy-cow-button"]

<body>
  <div>
    <div
      class="card"
    >
      <h5

[Killed] StringLiteral
main/components/Commons/ManageCows.js:28:130
 
                         <br/>
                         <br/>
-                        <Button variant="outline-danger" onClick={()=>{onSell(userCommons, userCommons.numOfCows)}} data-testid={"sell-all-cows-button"}>Sell all cows</Button>
+                        <Button variant="outline-danger" onClick={()=>{onSell(userCommons, userCommons.numOfCows)}} data-testid={""}>Sell all cows</Button>
                         <br/>
                         <br/>
killedBy: PlayPage tests click sell all button
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="sell-all-cows-button"]

<body>
  <div>
    <div
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >
      <div
