[Killed] ConditionalExpression
main/components/Commons/CommonsOverview.js:12:30
     let navigate = useNavigate();
     // Stryker disable next-line all
     const leaderboardButtonClick = () => { navigate("/leaderboard/" + commons.id) };
-    const showLeaderboard = (hasRole(currentUser, "ROLE_ADMIN") || commons.showLeaderboard );
+    const showLeaderboard = (false );
 
     const today = new Date();
killedBy: CommonsOverview tests Redirects to the LeaderboardPage for an admin when you click visit
statusReason: Error: Unable to find an element by: [data-testid="user-leaderboard-button"]

<body>
  <div>
    <div
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >
      <div
