[Killed] StringLiteral
src/main/pages/AdminCreateCommonsPage.js:11:14
 const AdminCreateCommonsPage = () => {
 
     const objectToAxiosParams = (newCommons) => ({
-        url: "/api/commons/new",
+        url: "",
         method: "POST",
         data: newCommons
killedBy: AdminCreateCommonsPage tests When you fill in form and click submit, the right things happens
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/"}

Number of calls: 0

[Killed] StringLiteral
src/main/pages/AdminCreateCommonsPage.js:12:17
 
     const objectToAxiosParams = (newCommons) => ({
         url: "/api/commons/new",
-        method: "POST",
+        method: "",
         data: newCommons
     });
killedBy: AdminCreateCommonsPage tests When you fill in form and click submit, the right things happens
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
src/main/pages/AdminCreateCommonsPage.js:20:20
         toast(<div>Commons successfully created!
             <br />{`id: ${commons.id}`}
             <br />{`name: ${commons.name}`}
-            <br />{`startDate: ${commons.startingDate}`}
+            <br />{``}
             <br />{`cowPrice: ${commons.cowPrice}`}
             <br />{`carryingCapacity: ${commons.carryingCapacity}`}
killedBy: AdminCreateCommonsPage tests When you fill in form and click submit, the right things happens
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

- Expected
+ Received

@@ -3,11 +3,11 @@
    <br />
    id: 5

[Killed] BlockStatement
src/main/pages/AdminCreateCommonsPage.js:37:29
         mutation.mutate(data);
     }
 
-    if (mutation.isSuccess) {
-        return <Navigate to="/" />
-    }
+    if (mutation.isSuccess) {}
 
     return (
killedBy: AdminCreateCommonsPage tests When you fill in form and click submit, the right things happens
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/"}

Number of calls: 0
