[Killed] ObjectLiteral
src/main/pages/AdminEditCommonsPage.js:14:7
     useBackend(
       // Stryker disable next-line all : don't test internal caching of React Query
       [`/api/commons?id=${id}`],
-      {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-        method: "GET",
-        url: `/api/commons`,
-        params: {
-          id
-        }
-      }
+      {}
     );
 
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find a label with the text of: /Commons Name/

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
src/main/pages/AdminEditCommonsPage.js:24:34
     );
 
 
-  const objectToAxiosPutParams = (commons) => ({
-    url: "/api/commons/update",
-    method: "PUT",
-    params: {
-      id: commons.id,
-    },
-    data: {
-        "name": commons.name,
-        "startingBalance": commons.startingBalance,
-        "cowPrice": commons.cowPrice,
-        "milkPrice": commons.milkPrice,
-        "startingDate": commons.startingDate,
-        "degradationRate": commons.degradationRate,
-        "carryingCapacity": commons.carryingCapacity,
-        "scaleCowSalePrice": commons.scaleCowSalePrice,
-        "showLeaderboard": commons.showLeaderboard,
-    }
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (_, commons) => {
killedBy: AdminEditCommonsPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
src/main/pages/AdminEditCommonsPage.js:27:13
   const objectToAxiosPutParams = (commons) => ({
     url: "/api/commons/update",
     method: "PUT",
-    params: {
-      id: commons.id,
-    },
+    params: {},
     data: {
         "name": commons.name,
killedBy: AdminEditCommonsPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "id": 5,
- }
