[Killed] StringLiteral
src/main/pages/PlayPage.js:52:14
       [`/api/profits/all/commonsid?commonsId=${commonsId}`],
       { // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
         method: "GET",
-        url: "/api/profits/all/commonsid",
+        url: "",
         params: {
           commonsId: commonsId
killedBy: PlayPage tests render profits table
statusReason: Error: Unable to find an element by: [data-testid="ProfitsTable-cell-row-0-col-Amount"]

<body>
  <div>
    <div
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >
      <div

[Killed] ObjectLiteral
src/main/pages/PlayPage.js:53:17
       { // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
         method: "GET",
         url: "/api/profits/all/commonsid",
-        params: {
-          commonsId: commonsId
-        }
+        params: {}
       }
     );
killedBy: PlayPage tests render profits table
statusReason: Error: Unable to find an element by: [data-testid="ProfitsTable-cell-row-0-col-Amount"]

<body>
  <div>
    <div
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >
      <div

[Killed] StringLiteral
src/main/pages/PlayPage.js:60:11
     );
 
   const onSuccessBuy = () => {
-    toast(`Cow bought!`);
+    toast(``);
   }
 
killedBy: PlayPage tests click buy max button
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Cow bought!"
Received: ""

Number of calls: 1

[Killed] ArrowFunction
src/main/pages/PlayPage.js:63:34
     toast(`Cow bought!`);
   }
 
-  const objectToAxiosParamsBuy = ({ newUserCommons, numCows }) => ({
-    url: "/api/usercommons/buy",
-    method: "PUT",
-    data: newUserCommons,
-    params: {
-      commonsId: commonsId,
-      numCows: numCows
-    }
-  });
+  const objectToAxiosParamsBuy = () => undefined;
 
   const mutationbuy = useBackendMutation(
killedBy: PlayPage tests click buy max button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
src/main/pages/PlayPage.js:80:43
     [`/api/usercommons/forcurrentuser?commonsId=${commonsId}`]
   );
 
-  const onBuy = (userCommons, numCows) => {
-    mutationbuy.mutate({ userCommons, numCows })
-  };
+  const onBuy = (userCommons, numCows) => {};
 
   const onSuccessSell = () => {
killedBy: PlayPage tests click buy max button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ArrowFunction
src/main/pages/PlayPage.js:88:35
     toast(`Cow sold!`);
   }
 
-  const objectToAxiosParamsSell = ({ newUserCommons, numCows }) => ({
-    url: "/api/usercommons/sell",
-    method: "PUT",
-    data: newUserCommons,
-    params: {
-      commonsId: commonsId,
-      numCows: numCows
-    }
-  });
+  const objectToAxiosParamsSell = () => undefined;
 
   const mutationsell = useBackendMutation(
killedBy: PlayPage tests click sell button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
src/main/pages/PlayPage.js:105:44
     [`/api/usercommons/forcurrentuser?commonsId=${commonsId}`]
   );
 
-  const onSell = (userCommons, numCows) => {
-    mutationsell.mutate({ userCommons, numCows })
-  };
+  const onSell = (userCommons, numCows) => {};
 
   return (
killedBy: PlayPage tests click sell button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:115:12
       { backgroundSize: 'cover', backgroundImage: `url(${Background})` }}>
       <BasicLayout >
         <Container >
-          {!!currentUser && <CommonsPlay currentUser={currentUser} />}
+          {false}
           {!!commons && <CommonsOverview commons={commons} currentUser={currentUser} />}
           <br />
killedBy: PlayPage tests Make sure CommonsPlay, CommonsOverview, ManageCows, FarmStats, and Profits show up
statusReason: Error: Unable to find an element with the text: /Welcome Farmer/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >
      <div

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:116:12
       <BasicLayout >
         <Container >
           {!!currentUser && <CommonsPlay currentUser={currentUser} />}
-          {!!commons && <CommonsOverview commons={commons} currentUser={currentUser} />}
+          {true}
           <br />
           {!!userCommons &&
killedBy: PlayPage tests Make sure CommonsPlay, CommonsOverview, ManageCows, FarmStats, and Profits show up
statusReason: Error: Unable to find an element with the text: /Announcements/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >
      <div

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:116:13
       <BasicLayout >
         <Container >
           {!!currentUser && <CommonsPlay currentUser={currentUser} />}
-          {!!commons && <CommonsOverview commons={commons} currentUser={currentUser} />}
+          {!commons && <CommonsOverview commons={commons} currentUser={currentUser} />}
           <br />
           {!!userCommons &&
killedBy: PlayPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'showLeaderboard')

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:118:12
           {!!currentUser && <CommonsPlay currentUser={currentUser} />}
           {!!commons && <CommonsOverview commons={commons} currentUser={currentUser} />}
           <br />
-          {!!userCommons &&
-            <CardGroup >
-              <ManageCows userCommons={userCommons} commons={commons} onBuy={onBuy} onSell={onSell} />
-              <FarmStats userCommons={userCommons} />
-              <Profits userCommons={userCommons} profits={userCommonsProfits} />
-            </CardGroup>
+          {false
           }
         </Container>
killedBy: PlayPage tests click buy max button
statusReason: Error: Unable to find an element by: [data-testid="buy-max-cows-button"]

<body>
  <div>
    <div
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >
      <div

[Killed] BooleanLiteral
src/main/pages/PlayPage.js:118:13
           {!!currentUser && <CommonsPlay currentUser={currentUser} />}
           {!!commons && <CommonsOverview commons={commons} currentUser={currentUser} />}
           <br />
-          {!!userCommons &&
+          {!userCommons &&
             <CardGroup >
               <ManageCows userCommons={userCommons} commons={commons} onBuy={onBuy} onSell={onSell} />
killedBy: PlayPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'numOfCows')
