[Killed] OptionalChaining
main/components/Commons/ManageCows.js:12:45
         <Card.Header as="h5">Manage Cows</Card.Header>
         <Card.Body>
             {/* change $10 to info from fixture */}
-            <Card.Title>Market Cow Price: ${commons?.cowPrice}</Card.Title>
+            <Card.Title>Market Cow Price: ${commons.cowPrice}</Card.Title>
             <Card.Title>Number of Cows: {userCommons.numOfCows}</Card.Title>
                 <Row>
killedBy: ManageCows tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'cowPrice')

[Killed] BlockStatement
main/components/Commons/ManageCows.js:21:71
                         </Card.Text>
                     </Col>
                     <Col>
-                        <Button variant="outline-danger" onClick={()=>{onBuy(userCommons, 10)}} data-testid={"buy-10-cows-button"}>Buy ten cows</Button>
+                        <Button variant="outline-danger" onClick={()=>{}} data-testid={"buy-10-cows-button"}>Buy ten cows</Button>
                         <br/>
killedBy: PlayPage tests click buy 10 button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/components/Commons/ManageCows.js:21:110
                         </Card.Text>
                     </Col>
                     <Col>
-                        <Button variant="outline-danger" onClick={()=>{onBuy(userCommons, 10)}} data-testid={"buy-10-cows-button"}>Buy ten cows</Button>
+                        <Button variant="outline-danger" onClick={()=>{onBuy(userCommons, 10)}} data-testid={""}>Buy ten cows</Button>
                         <br/>
killedBy: ManageCows tests buy 10 cows
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="buy-10-cows-button"]

<body>
  <div>
    <div
      class="card"
    >
      <h5

[Killed] BlockStatement
main/components/Commons/ManageCows.js:25:71
                         <br/>
                         <br/>
-                        <Button variant="outline-danger" onClick={()=>{onBuy(userCommons, 1)}} data-testid={"buy-cow-button"}>Buy cow</Button>
+                        <Button variant="outline-danger" onClick={()=>{}} data-testid={"buy-cow-button"}>Buy cow</Button>
                         <br/>
                         <br/>
killedBy: PlayPage tests click buy button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/components/Commons/ManageCows.js:28:71
                         <Button variant="outline-danger" onClick={()=>{onBuy(userCommons, 1)}} data-testid={"buy-cow-button"}>Buy cow</Button>
                         <br/>
                         <br/>
-                        <Button variant="outline-danger" onClick={()=>{onSell(userCommons, 1)}} data-testid={"sell-cow-button"}>Sell cow</Button>
+                        <Button variant="outline-danger" onClick={()=>{}} data-testid={"sell-cow-button"}>Sell cow</Button>
                         <br/>
                         <br/>
killedBy: PlayPage tests click sell button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/components/Commons/ManageCows.js:31:71
                         <Button variant="outline-danger" onClick={()=>{onSell(userCommons, 1)}} data-testid={"sell-cow-button"}>Sell cow</Button>
                         <br/>
                         <br/>
-                        <Button variant="outline-danger" onClick={()=>{onSell(userCommons, 10)}} data-testid={"sell-10-cows-button"}>Sell ten cows</Button>
+                        <Button variant="outline-danger" onClick={()=>{}} data-testid={"sell-10-cows-button"}>Sell ten cows</Button>
                         <Button variant="outline-danger" onClick={()=>{onSell(userCommons, userCommons.numOfCows)}} data-testid={"sell-all-cows-button"}>Sell all cows</Button>
                         <br/>
killedBy: PlayPage tests click sell 10 button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/components/Commons/ManageCows.js:31:111
                         <Button variant="outline-danger" onClick={()=>{onSell(userCommons, 1)}} data-testid={"sell-cow-button"}>Sell cow</Button>
                         <br/>
                         <br/>
-                        <Button variant="outline-danger" onClick={()=>{onSell(userCommons, 10)}} data-testid={"sell-10-cows-button"}>Sell ten cows</Button>
+                        <Button variant="outline-danger" onClick={()=>{onSell(userCommons, 10)}} data-testid={""}>Sell ten cows</Button>
                         <Button variant="outline-danger" onClick={()=>{onSell(userCommons, userCommons.numOfCows)}} data-testid={"sell-all-cows-button"}>Sell all cows</Button>
                         <br/>
killedBy: PlayPage tests click sell 10 button
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="sell-10-cows-button"]

<body>
  <div>
    <div
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >
      <div

[Killed] BlockStatement
main/components/Commons/ManageCows.js:32:71
                         <br/>
                         <br/>
                         <Button variant="outline-danger" onClick={()=>{onSell(userCommons, 10)}} data-testid={"sell-10-cows-button"}>Sell ten cows</Button>
-                        <Button variant="outline-danger" onClick={()=>{onSell(userCommons, userCommons.numOfCows)}} data-testid={"sell-all-cows-button"}>Sell all cows</Button>
+                        <Button variant="outline-danger" onClick={()=>{}} data-testid={"sell-all-cows-button"}>Sell all cows</Button>
                         <br/>
                         <br/>
killedBy: PlayPage tests click sell all button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
