[Killed] BlockStatement
src/main/utils/dateUtils.js:10:53
 }
 
 
-const calculateDays = (startingDate,currentDate) => {
-    const start = new Date(startingDate);
-    const today = new Date(currentDate);
-    const timeDifference = today.getTime() - start.getTime();
-    const days = Math.floor(timeDifference / (1000 * 3600 * 24))+1;
-    return days;
-  }
+const calculateDays = (startingDate,currentDate) => {}
 
 export {timestampToDate, padWithZero, calculateDays};
killedBy: dateUtils tests calculateDays tests with mock current date 2023-06-01T00:00:00
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 32
Received: undefined

[Killed] ArithmeticOperator
src/main/utils/dateUtils.js:13:28
 const calculateDays = (startingDate,currentDate) => {
     const start = new Date(startingDate);
     const today = new Date(currentDate);
-    const timeDifference = today.getTime() - start.getTime();
+    const timeDifference = today.getTime() + start.getTime();
     const days = Math.floor(timeDifference / (1000 * 3600 * 24))+1;
     return days;
killedBy: dateUtils tests calculateDays tests with mock current date 2023-06-01T00:00:00
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 32
Received: 38988

[Killed] ArithmeticOperator
src/main/utils/dateUtils.js:14:29
     const start = new Date(startingDate);
     const today = new Date(currentDate);
     const timeDifference = today.getTime() - start.getTime();
-    const days = Math.floor(timeDifference / (1000 * 3600 * 24))+1;
+    const days = Math.floor(timeDifference * (1000 * 3600 * 24))+1;
     return days;
   }
killedBy: CommonsOverview tests contains the correct content
statusReason: Error: Unable to find an element with the text: /Today is day 5!/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="card"
      data-testid="CommonsOverview"
    >

[Killed] ArithmeticOperator
src/main/utils/dateUtils.js:14:47
     const start = new Date(startingDate);
     const today = new Date(currentDate);
     const timeDifference = today.getTime() - start.getTime();
-    const days = Math.floor(timeDifference / (1000 * 3600 * 24))+1;
+    const days = Math.floor(timeDifference / (1000 * 3600 / 24))+1;
     return days;
   }
killedBy: CommonsOverview tests contains the correct content
statusReason: Error: Unable to find an element with the text: /Today is day 5!/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="card"
      data-testid="CommonsOverview"
    >
