[Killed] ArrowFunction
src/main/pages/PlayPage.js:88:35
     toast(`Cow sold!`);
   }
 
-  const objectToAxiosParamsSell = (newUserCommons) => ({
-    url: "/api/usercommons/sell",
-    method: "PUT",
-    data: newUserCommons,
-    params: {
-      commonsId: commonsId
-    }
-  });
+  const objectToAxiosParamsSell = () => undefined;
 
   const mutationsell = useBackendMutation(
killedBy: PlayPage tests click sell button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
src/main/pages/PlayPage.js:99:5
 
   const mutationsell = useBackendMutation(
     objectToAxiosParamsSell,
-    { onSuccess: onSuccessSell },
+    {},
     // Stryker disable next-line all : hard to set up test for caching
     [`/api/usercommons/forcurrentuser?commonsId=${commonsId}`]
killedBy: PlayPage tests click sell button
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Cow sold!"

Number of calls: 0

[Killed] LogicalOperator
src/main/pages/PlayPage.js:115:12
       <BasicLayout >
         <Container >
           {!!currentUser && <CommonsPlay currentUser={currentUser} />}
-          {!!commons && <CommonsOverview commons={commons} currentUser={currentUser} />}
+          {!!commons || <CommonsOverview commons={commons} currentUser={currentUser} />}
           <br />
           {!!userCommons &&
killedBy: PlayPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'showLeaderboard')

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:115:12
       <BasicLayout >
         <Container >
           {!!currentUser && <CommonsPlay currentUser={currentUser} />}
-          {!!commons && <CommonsOverview commons={commons} currentUser={currentUser} />}
+          {false}
           <br />
           {!!userCommons &&
killedBy: PlayPage tests Make sure CommonsPlay, CommonsOverview, ManageCows, FarmStats, and Profits show up
statusReason: Error: Unable to find an element with the text: /Announcements/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >
      <div

[Killed] LogicalOperator
src/main/pages/PlayPage.js:117:12
           {!!currentUser && <CommonsPlay currentUser={currentUser} />}
           {!!commons && <CommonsOverview commons={commons} currentUser={currentUser} />}
           <br />
-          {!!userCommons &&
-            <CardGroup >
-              <ManageCows userCommons={userCommons} commons={commons} onBuy={onBuy} onSell={onSell} />
-              <FarmStats userCommons={userCommons} />
-              <Profits userCommons={userCommons} profits={userCommonsProfits} />
-            </CardGroup>
+          {!!userCommons || <CardGroup>
+              <ManageCows userCommons={userCommons} commons={commons} onBuy={onBuy} onSell={onSell} />
+              <FarmStats userCommons={userCommons} />
+              <Profits userCommons={userCommons} profits={userCommonsProfits} />
+            </CardGroup>
           }
         </Container>
killedBy: PlayPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'numOfCows')
