[Killed] ObjectLiteral
main/components/Profile/ProfileTable.js:19:9
             Header:'Cow Price',
             accessor: 'cowPrice',
         },
-        {
-            Header:'Milk Price',
-            accessor: 'milkPrice',
-        },
+        {},
         {
             Header:'Starting Balance',
killedBy: ProfileTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Profile/ProfileTable.js:23:9
             Header:'Milk Price',
             accessor: 'milkPrice',
         },
-        {
-            Header:'Starting Balance',
-            accessor: 'startingBalance',
-        },
+        {},
         {
             Header:'Starting Date',
killedBy: ProfileTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Profile/ProfileTable.js:29:23
         },
         {
             Header:'Starting Date',
-            accessor: 'startingDate',
+            accessor: "",
         },
         {
killedBy: ProfileTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ProfileTable-cell-row-0-col-startingDate"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white;"

[Survived] StringLiteral
main/components/Profile/ProfileTable.js:37:17
         },
         {
             Header:'Show Leaderboard?',
-            id: 'showLeaderboard', // needed for tests
+            id: "", // needed for tests
             accessor: (row) => String(row.showLeaderboard) // hack needed for boolean values to show up
         },

[Survived] ArrowFunction
main/components/Profile/ProfileTable.js:38:23
         {
             Header:'Show Leaderboard?',
             id: 'showLeaderboard', // needed for tests
-            accessor: (row) => String(row.showLeaderboard) // hack needed for boolean values to show up
+            accessor: () => undefined // hack needed for boolean values to show up
         },
         {

[Killed] StringLiteral
main/components/Profile/ProfileTable.js:42:23
         },
         {
             Header:'Carrying Capacity',
-            accessor: 'carryingCapacity',
+            accessor: "",
         },
     ];
killedBy: ProfileTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ProfileTable-cell-row-0-col-carryingCapacity"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white;"
