[Survived] ArrayDeclaration
src/main/pages/ProfilePage.js:11:56
 
 export default function ProfilePage () {
 
-    const [commonsJoined, setCommonsJoined] = useState([]);
+    const [commonsJoined, setCommonsJoined] = useState(["Stryker was here"]);
     const { data: currentUser } = useCurrentUser();
 

[Survived] BlockStatement
src/main/pages/ProfilePage.js:15:11
     const { data: currentUser } = useCurrentUser();
 
     useEffect(
-    () => {
-        if (currentUser?.root?.user?.commons) {
-        setCommonsJoined(currentUser.root.user.commons);
-        }
-    }, [currentUser]
+    () => {}, [currentUser]
     );
 

[Killed] OptionalChaining
src/main/pages/ProfilePage.js:16:13
 
     useEffect(
     () => {
-        if (currentUser?.root?.user?.commons) {
+        if (currentUser?.root.user?.commons) {
         setCommonsJoined(currentUser.root.user.commons);
         }
killedBy: ProfilePage tests renders without crashing for regular user
statusReason: TypeError: Cannot read properties of null (reading 'user')

[Killed] ConditionalExpression
src/main/pages/ProfilePage.js:16:13
 
     useEffect(
     () => {
-        if (currentUser?.root?.user?.commons) {
+        if (true) {
         setCommonsJoined(currentUser.root.user.commons);
         }
killedBy: ProfilePage tests renders without crashing for regular user
statusReason: TypeError: Cannot read properties of null (reading 'user')
