[Killed] BlockStatement
main/components/Commons/ManageCows.js:22:71
                     </Col>
                     <Col>
                         <br/>
-                        <Button variant="outline-danger" onClick={()=>{onBuy(userCommons, 10)}} data-testid={"buy-10-cows-button"}>Buy ten cows</Button>
+                        <Button variant="outline-danger" onClick={()=>{}} data-testid={"buy-10-cows-button"}>Buy ten cows</Button>
                         <br/>
killedBy: PlayPage tests click buy 10 button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/components/Commons/ManageCows.js:22:110
                     </Col>
                     <Col>
                         <br/>
-                        <Button variant="outline-danger" onClick={()=>{onBuy(userCommons, 10)}} data-testid={"buy-10-cows-button"}>Buy ten cows</Button>
+                        <Button variant="outline-danger" onClick={()=>{onBuy(userCommons, 10)}} data-testid={""}>Buy ten cows</Button>
                         <br/>
killedBy: ManageCows tests buy 10 cows
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="buy-10-cows-button"]

<body>
  <div>
    <div
      class="card"
    >
      <h5

[Killed] BlockStatement
main/components/Commons/ManageCows.js:32:71
                         <br/>
                         <Button variant="outline-danger" onClick={()=>{onSell(userCommons, 10)}} data-testid={"sell-10-cows-button"}>Sell ten cows</Button>
                         <br/>
-                        <Button variant="outline-danger" onClick={()=>{onSell(userCommons, userCommons.numOfCows)}} data-testid={"sell-all-cows-button"}>Sell all cows</Button>
+                        <Button variant="outline-danger" onClick={()=>{}} data-testid={"sell-all-cows-button"}>Sell all cows</Button>
                         <br/>
                     </Col>
killedBy: PlayPage tests click sell all button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
